---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Analysis.MEPNetworkSegmentId
source: html/8cd82ce0-b228-b5b2-0e94-f03b4d166a56.htm
---
# MEPNetworkSegmentId Members

Creates a default invalid segment id on the network.